In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = pd.DataFrame({'city':['jaipur','chomu','churu','jaipur','jodhpur','chomu'],'price':[123,432,123,321,234,543]})

In [3]:
df

      city  price
0   jaipur    123
1    chomu    432
2    churu    123
3   jaipur    321
4  jodhpur    234
5    chomu    543

In [5]:
encoded_data = df.groupby('city')['price'].mean().to_dict()

In [6]:
encoded_data

{'chomu': 487.5, 'churu': 123.0, 'jaipur': 222.0, 'jodhpur': 234.0}

In [7]:
df['city_encoded'] = df['city'].map(encoded_data)

In [8]:
df

      city  price  city_encoded
0   jaipur    123         222.0
1    chomu    432         487.5
2    churu    123         123.0
3   jaipur    321         222.0
4  jodhpur    234         234.0
5    chomu    543         487.5